clear; clc;
% 原始数据
x = [7, 10.5, 13, 17.5, 34, 40.5, 44.5, 48, 56, 61, 68.5, 76.5, 80.5, 91, 96, 101, 104, 106.5, 111.5, 118, 123.5, 136.5, 142, 146, 150, 157, 158];
y1 = [44, 45, 47, 50, 50, 38, 30, 30, 34, 36, 34, 41, 45, 46, 43, 37, 33, 28, 32, 65, 55, 54, 52, 50, 66, 66, 68];
y2 = [44, 59, 70, 72, 93, 100, 110, 110, 110, 117, 118, 116, 118, 118, 121, 124, 121, 121, 121, 122, 116, 83, 81, 82, 86, 85, 68];

% 通过三次样条插值计算结果
xi = linspace(7, 158, 500);
y1_interp = interp1(x, y1, xi,  'spline');  %将此处的spline改成linear即可得到一维线性插值的结果
y2_interp = interp1(x, y2, xi,  'spline');
% 绘制插值结果
plot([xi, fliplr(xi)], [y1_interp, fliplr(y2_interp)],  'color',  '#EDB120',  'linewidth', 1.2); hold on;
% 绘制测量结果
plot([x, x], [y1, y2],  'x',  'color',  '#0072BD',  'markersize', 8); hold on;
legend('三次样条插值结果','测量结果')
axis equal  %各坐标轴同比例
ratio = (40/18)^2;
S = (trapz(xi, y2_interp) - trapz(xi, y1_interp)) * ratio;
disp(['该国家的国土面积约为：', num2str(S),  ' 平方千米'])
