X = [464 788 229 13 127 13;
499 8605 1444 403 557 1223;
5 9 3 20 23 124;
62 527 128 163 67 146;
79 749 140 43 130 273;
146 1285 272 225 219 542]; % 6个部门间的投入产出值
X_colsum = [2918 16814 2875 1570 2341 5414]; % 每个部门的总产出

X_rep = repmat( X_colsum,6,1); %将行向量X_colsum复制6份，扩展为6*6矩阵

% 问题（1）的求解
A = X./X_rep % 计算直接消耗系数矩阵
Xx = 100;
Xx*A(:,1) %农业产出100亿元所产生的中间需求x1a1

% 问题（2）的求解
y = [1500;4200;3000;500;950;3000]; % 输入外部需求y
n = size(y,1);
W = eye(n) - A; % I-A
x = W\y % 解方程组（5-6）

% 问题（3）的求解
dx = inv(W) % 求I-A 的逆矩阵

% 问题（5）的求解
B = dx - eye(n) % 求完全消耗系数矩阵