% 明文
M=[13,18,27,8,9,12,12,27;
13,1,4,5,27,20,8,9;
19,27,3,15,4,5,28,27;
]
% 密钥
K=[12 16 5; 8 3 5; 7 9 3];

det(K) %验证密码矩阵是否可逆

C = mod(K * M,28) %密文
INV_K = inv(K);
INV_K = round(INV_K); %以整数形式参与运算
K2 = mod(INV_K,28) %解密的钥匙
Y = mod(K2 * C,28) %恢复明文


% ============= K2 ============= 
M=[13,18,27,8,9,12;
12,27,13,1,4,5;
27,20,8,9,19,27;
3,15,4,5,28,0;]
% 密钥
K=[5,2,3,4;
8,5,5,4;
1,1,3,3;
5,4,3,1;];

det(K) %验证密码矩阵是否可逆
C = mod(K * M,28) %密文
INV_K = inv(K);
INV_K = round(INV_K); %以整数形式参与运算
K2 = mod(INV_K,28) %解密的钥匙
Y = mod(K2 * C,28) %恢复明文




